/* 함수의 매개변수 */
/* 
   매개변수는 함수가 호출할때 전달된 값(인자 또는 인수로 부릅니다)으로 초기화되는 변수입니다.
   함수가 실행될 때 만들어지고, 함수가 종료될 때 없어집니다. 
   매개변수를 쓰려면 함수 선언 및 정의에서 ( ) 안에 타입과 이름을 적으면 됩니다. 
   매개변수가 있는 함수의 선언은 타입 이름 ( 타입 이름 ) ; 이고, 
   매개변수가 있는 함수의 정의는 타입 이름 ( 타입 이름 ) { } 입니다. 
   매개변수가 있는 함수를 호출하는 식은 식 ( 식 ) 입니다. 
   괄호 왼쪽 식은 호출할 함수를 가리키고, 괄호 안의 식은 인자가 됩니다.
*/

/* To Do: 함수 add1의 선언에서 매개변수를 추가해보세요. 매개변수의 타입은 int이고, 이름은 number로 해보세요. */
int add1();

int main() {
	/* To Do: 함수 add1의 호출식에 값이 1인 인자를 넣어보세요 */
	return add1();
}

/* To Do: 함수 add1의 정의에서 매개변수를 추가해보세요. 매개변수의 타입은 int이고, 이름은 x로 해보세요. */
int add1() {
	/* To Do: 반환 값을 매개변수 x에 1을 더한 값으로 바꿔보세요 */
	return 0;
}
